Model: "GraphSEG_v1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
X_in (InputLayer)               [(None, 3)]          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 64)           192         X_in[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 64)           4096        gcn_conv[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_1 (BatchNormalization)       (None, 64)           256         gcn_conv_1[0][0]                 
__________________________________________________________________________________________________
gcn_conv_2 (GCNConv)            (None, 64)           4096        bn_1[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_3 (GCNConv)            (None, 64)           4096        gcn_conv_2[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_2 (BatchNormalization)       (None, 64)           256         gcn_conv_3[0][0]                 
__________________________________________________________________________________________________
segment_ids_in (InputLayer)     [(None,)]            0                                            
__________________________________________________________________________________________________
mp_2 (GlobalMaxPool)            (None, 64)           0           bn_2[0][0]                       
                                                                 segment_ids_in[0][0]             
__________________________________________________________________________________________________
gcn_conv_4 (GCNConv)            (None, 64)           4096        mp_2[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_5 (GCNConv)            (None, 64)           4096        gcn_conv_4[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_3 (BatchNormalization)       (None, 64)           256         gcn_conv_5[0][0]                 
__________________________________________________________________________________________________
mp_3 (GlobalMaxPool)            (None, 64)           0           bn_3[0][0]                       
                                                                 segment_ids_in[0][0]             
__________________________________________________________________________________________________
gcn_conv_6 (GCNConv)            (None, 64)           4096        mp_3[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_7 (GCNConv)            (None, 64)           4096        gcn_conv_6[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_4 (BatchNormalization)       (None, 64)           256         gcn_conv_7[0][0]                 
__________________________________________________________________________________________________
mp_4 (GlobalMaxPool)            (None, 64)           0           bn_4[0][0]                       
                                                                 segment_ids_in[0][0]             
__________________________________________________________________________________________________
gcn_conv_8 (GCNConv)            (None, 64)           4096        mp_4[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_9 (GCNConv)            (None, 64)           4096        gcn_conv_8[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
mp_5 (GlobalMaxPool)            (None, 64)           0           gcn_conv_9[0][0]                 
                                                                 segment_ids_in[0][0]             
__________________________________________________________________________________________________
do_1 (Dropout)                  (None, 64)           0           mp_5[0][0]                       
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 320)          0           do_1[0][0]                       
                                                                 mp_5[0][0]                       
                                                                 mp_4[0][0]                       
                                                                 mp_3[0][0]                       
                                                                 mp_2[0][0]                       
__________________________________________________________________________________________________
do_2 (Dropout)                  (None, 320)          0           concatenate[0][0]                
__________________________________________________________________________________________________
gcn_conv_10 (GCNConv)           (None, 64)           20480       do_2[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_11 (GCNConv)           (None, 64)           4096        gcn_conv_10[0][0]                
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_12 (GCNConv)           (None, 20)           1280        gcn_conv_11[0][0]                
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 63,936
Trainable params: 63,424
Non-trainable params: 512
__________________________________________________________________________________________________
