Model: "GraphSEG_v2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
X_in (InputLayer)               [(None, 4)]          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 64)           256         X_in[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 64)           4096        gcn_conv[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_2 (BatchNormalization)       (None, 64)           256         gcn_conv_1[0][0]                 
__________________________________________________________________________________________________
do_2 (Dropout)                  (None, 64)           0           bn_2[0][0]                       
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64)           0           do_2[0][0]                       
                                                                 gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_2 (GCNConv)            (None, 64)           4096        add_2[0][0]                      
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_3 (BatchNormalization)       (None, 64)           256         gcn_conv_2[0][0]                 
__________________________________________________________________________________________________
do_3 (Dropout)                  (None, 64)           0           bn_3[0][0]                       
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64)           0           do_3[0][0]                       
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
gcn_conv_3 (GCNConv)            (None, 64)           4096        add_3[0][0]                      
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
bn_4 (BatchNormalization)       (None, 64)           256         gcn_conv_3[0][0]                 
__________________________________________________________________________________________________
do_4 (Dropout)                  (None, 64)           0           bn_4[0][0]                       
__________________________________________________________________________________________________
add_4 (Add)                     (None, 64)           0           do_4[0][0]                       
                                                                 gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_4 (GCNConv)            (None, 20)           1280        add_4[0][0]                      
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 14,592
Trainable params: 14,208
Non-trainable params: 384
__________________________________________________________________________________________________
