Model: "GraphSEG_v2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
X_in (InputLayer)               [(None, 6)]          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 32)           192         X_in[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 32)           1024        gcn_conv[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 32)           128         gcn_conv_1[0][0]                 
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32)           0           batch_normalization[0][0]        
__________________________________________________________________________________________________
gcn_conv_2 (GCNConv)            (None, 32)           1024        dropout[0][0]                    
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32)           128         gcn_conv_2[0][0]                 
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32)           0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
gcn_conv_3 (GCNConv)            (None, 32)           1024        dropout_1[0][0]                  
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32)           128         gcn_conv_3[0][0]                 
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32)           0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64)           0           dropout_2[0][0]                  
                                                                 dropout[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 96)           0           concatenate[0][0]                
                                                                 gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_4 (GCNConv)            (None, 20)           1920        concatenate_1[0][0]              
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 5,568
Trainable params: 5,376
Non-trainable params: 192
__________________________________________________________________________________________________
