Model: "U-GCN4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
X_in (InputLayer)               [(None, 7)]          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 32)           224         X_in[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 32)           1024        gcn_conv[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_2 (GCNConv)            (None, 32)           1024        gcn_conv_1[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_3 (GCNConv)            (None, 32)           1024        gcn_conv_2[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_4 (GCNConv)            (None, 32)           1024        gcn_conv_3[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
gcn_conv_5 (GCNConv)            (None, 32)           1024        gcn_conv_4[0][0]                 
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64)           0           gcn_conv_5[0][0]                 
                                                                 gcn_conv_4[0][0]                 
__________________________________________________________________________________________________
gcn_conv_6 (GCNConv)            (None, 32)           2048        concatenate[0][0]                
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64)           0           gcn_conv_6[0][0]                 
                                                                 gcn_conv_3[0][0]                 
__________________________________________________________________________________________________
gcn_conv_7 (GCNConv)            (None, 32)           2048        concatenate_1[0][0]              
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64)           0           gcn_conv_7[0][0]                 
                                                                 gcn_conv_2[0][0]                 
__________________________________________________________________________________________________
gcn_conv_8 (GCNConv)            (None, 32)           2048        concatenate_2[0][0]              
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64)           0           gcn_conv_8[0][0]                 
                                                                 gcn_conv_1[0][0]                 
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 96)           0           concatenate_3[0][0]              
                                                                 gcn_conv[0][0]                   
__________________________________________________________________________________________________
segment_ids_in (InputLayer)     [(None,)]            0                                            
__________________________________________________________________________________________________
gcn_conv_9 (GCNConv)            (None, 20)           1920        concatenate_4[0][0]              
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 13,408
Trainable params: 13,408
Non-trainable params: 0
__________________________________________________________________________________________________
