{"class_name": "Functional", "config": {"name": "Res_GCN_v7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 7], "dtype": "float32", "sparse": false, "ragged": false, "name": "X_in"}, "name": "X_in", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": true, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "GConv", "config": {"name": "g_conv", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv", "inbound_nodes": [[["X_in", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_1", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_1", "inbound_nodes": [[["g_conv", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_2", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_2", "inbound_nodes": [[["g_conv_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_3", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_3", "inbound_nodes": [[["g_conv_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_4", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_4", "inbound_nodes": [[["g_conv_3", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_5", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_5", "inbound_nodes": [[["g_conv_4", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["g_conv_5", 0, 0, {}], ["g_conv_4", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_6", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_6", "inbound_nodes": [[["concatenate", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["g_conv_6", 0, 0, {}], ["g_conv_3", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_7", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["g_conv_7", 0, 0, {}], ["g_conv_2", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_8", "trainable": true, "dtype": "float32", "units": 32}, "name": "g_conv_8", "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["g_conv_8", 0, 0, {}], ["g_conv_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}], ["g_conv", 0, 0, {}]]]}, {"class_name": "GConv", "config": {"name": "g_conv_9", "trainable": true, "dtype": "float32", "units": 20}, "name": "g_conv_9", "inbound_nodes": [[["concatenate_4", 0, 0, {}], ["input_1", 0, 0, {}]]]}], "input_layers": [["X_in", 0, 0], ["input_1", 0, 0]], "output_layers": [["g_conv_9", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}