Model: "PointSegGCN_v1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
X_in (InputLayer)               [(None, 7)]          0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
g_conv (GConv)                  (None, 32)           256         X_in[0][0]                       
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
g_conv_1 (GConv)                (None, 32)           1056        g_conv[0][0]                     
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
g_conv_2 (GConv)                (None, 32)           1056        g_conv_1[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
g_conv_3 (GConv)                (None, 32)           1056        g_conv_2[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
g_conv_4 (GConv)                (None, 32)           1056        g_conv_3[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
g_conv_5 (GConv)                (None, 32)           1056        g_conv_4[0][0]                   
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64)           0           g_conv_5[0][0]                   
                                                                 g_conv_4[0][0]                   
__________________________________________________________________________________________________
g_conv_6 (GConv)                (None, 32)           2080        concatenate[0][0]                
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64)           0           g_conv_6[0][0]                   
                                                                 g_conv_3[0][0]                   
__________________________________________________________________________________________________
g_conv_7 (GConv)                (None, 32)           2080        concatenate_1[0][0]              
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64)           0           g_conv_7[0][0]                   
                                                                 g_conv_2[0][0]                   
__________________________________________________________________________________________________
g_conv_8 (GConv)                (None, 32)           2080        concatenate_2[0][0]              
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64)           0           g_conv_8[0][0]                   
                                                                 g_conv_1[0][0]                   
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 96)           0           concatenate_3[0][0]              
                                                                 g_conv[0][0]                     
__________________________________________________________________________________________________
g_conv_9 (GConv)                (None, 20)           1940        concatenate_4[0][0]              
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 13,716
Trainable params: 13,716
Non-trainable params: 0
__________________________________________________________________________________________________
